import Navbar from '../Home/Navbar';
import Footer from './Footer';
import './policy.css';
import icon1 from '../../image/icon.jpg';
import { Link } from 'react-router-dom';
import { useEffect } from 'react';
export default function Privacy() {
  const scroll1 = useEffect(() => window.scrollTo(0, 0));
  return (
    <>
      <Navbar />
      <div className="p1">
        <div className="box-up">
          <Link to="/">
            <span className="	fas fa-chevron-left"></span>
          </Link>
          {/* <span className="	far fa-edit"></span> */}
          <img
            src={icon1}
            alt="err"
            style={{
              width: '60px',

              border: '1px solid #ccc',
              borderRadius: '12px',
            }}
          />
          <p clasclassNames="title">شروط الاستخدام وإخلاء المسؤولية</p>
        </div>
        <span>تاريخ السريان: [00/00/0000]</span>
        <p className="phar">
          مرحبًا بكم في موقع <span className="name">Smart World</span> تنظم هذه
          الشروط والأحكام استخدامك لموقعنا الإلكتروني
          <span>smart_world@gmail.com</span>، بما في ذلك أي خدمات أو ميزات متاحة
          من خلال الموقع. باستخدامك للموقع، فإنك توافق على الالتزام بهذه الشروط.
        </p>
        <ol>
          <li className="title-ul"> 1 . القبول بالشروط:</li>
          <ul>
            بدخولك إلى الموقع أو استخدامه، فإنك توافق على الالتزام بالشروط
            والأحكام وسياسة الخصوصية الخاصة بنا. إذا كنت لا توافق على أي جزء من
            الشروط، يُرجى التوقف عن استخدام الموقع.
          </ul>
          <li className="title-ul">2 . الأهلية:</li>
          <ul>
            <li> يجب أن تكون قد بلغت السن القانوني في بلدك للتعاقد.</li>
            <li>
              استخدام الموقع متاح فقط للأفراد أو الكيانات المصرح لها قانونيًا
              بالمشاركة في المزادات والمناقصات.
            </li>
          </ul>
          <li className="title-ul">3 . إنشاء الحساب:</li>
          <ul>
            <li>يجب على المستخدمين إنشاء حساب للوصول إلى بعض ميزات الموقع.</li>
            <li> يُطلب منك تقديم معلومات دقيقة ومحدثة عند التسجيل.</li>
            <li>
              تتحمل المسؤولية الكاملة عن الحفاظ على سرية بيانات تسجيل الدخول
              الخاصة بك.
            </li>
          </ul>
          <li className="title-ul">4 . استخدام الموقع:</li>
          <ul>
            <li>
              {' '}
              يلتزم المستخدمون باستخدام الموقع فقط للأغراض القانونية والمسموح
              بها.
            </li>
            <li>
              يُمنع القيام بأي نشاط يتسبب في تعطيل الموقع أو الإضرار به أو
              التدخل في استخدام الآخرين له.
            </li>
            <li> يحظر استخدام تقنيات الاحتيال أو تقديم معلومات مضللة.</li>
          </ul>

          <li className="title-ul">5 . العمليات والمزادات:</li>
          <ul>
            <li>
              تُعرض المنتجات أو الخدمات على الموقع من قبل مزودين أو أطراف ثالثة.
            </li>
            <li> يلتزم المشاركون بالمزايدة أو تقديم العطاءات بحسن نية.</li>
            <li> جميع العطاءات أو المزايدات المقدمة تُعتبر ملزمة.</li>
          </ul>
          <li className="title-ul">6 . الرسوم والمدفوعات:</li>
          <ul>
            <li> قد يتطلب استخدام بعض الخدمات دفع رسوم.</li>
            <li> جميع المدفوعات تتم وفقًا للسياسات الموضحة على الموقع.</li>
            <li>
              تحتفظ الإدارة بحقها في تغيير الرسوم أو فرض رسوم جديدة مع إخطار
              مسبق.
            </li>
          </ul>
          <li className="title-ul">7 . حقوق الملكية الفكرية:</li>
          <ul>
            <li>
              جميع المحتويات المتاحة على الموقع، بما في ذلك النصوص والصور
              والشعارات، هي ملكية فكرية خاصة بنا أو مُرخّصة لنا.
            </li>
            <li>
              يُحظر نسخ أو تعديل أو إعادة نشر أي جزء من المحتوى دون إذن كتابي
              مسبق.
            </li>
          </ul>
          <li className="title-ul">8 . حدود المسؤولية:</li>
          <ul>
            <li>
              نحن لا نتحمل أي مسؤولية عن الخسائر الناجمة عن الاستخدام غير الصحيح
              للموقع أو بسبب أعطال تقنية خارجة عن إرادتنا.
            </li>
            <li> يُستخدم الموقع على مسؤوليتك الشخصية.</li>
          </ul>
          <li className="title-ul">9 . الإنهاء:</li>
          <ul>
            <li> نحتفظ بالحق في تعليق أو إنهاء حسابك إذا خالفت الشروط.</li>
            <li> يمكنك إغلاق حسابك في أي وقت عبر التواصل معنا.</li>
          </ul>
          <li className="title-ul">10 . تعديلات على الشروط:</li>
          <ul>
            قد نقوم بتعديل هذه الشروط من وقت لآخر. يُعتبر استمرارك في استخدام
            الموقع بعد التعديلات موافقة منك على الشروط الجديدة.
          </ul>
          <li className="title-ul">11 . القانون المُطبق:</li>
          <ul>
            <li> تخضع هذه الشروط لقوانين [دولتك/منطقتك].</li>
            <li>
              يتم حل أي نزاعات تنشأ عن استخدام الموقع عبر التحكيم أو المحاكم
              المختصة.
            </li>
          </ul>
          <li className="title-ul">12 . تواصل معنا:</li>
          <ul>
            إذا كانت لديك أي استفسارات حول هذه الشروط، يُرجى التواصل معنا عبر:
            <ul>
              smart_world@gmail.com
              <span className="dsa">
                <i className="		fas fa-envelope-open"></i>
              </span>
            </ul>
            <ul>
              123-456-789
              <span className="dsa">
                <i className="fas fa-phone"></i>
              </span>
            </ul>
            باستخدامك للموقع، فإنك توافق على الالتزام بهذه الشروط والأحكام.
          </ul>
        </ol>
      </div>
      <Footer black="privacy1" />
    </>
  );
}
