import { Link } from 'react-router-dom';
import './policy.css';
import Navbar from '../Home/Navbar';
import Footer from './Footer';
import { useEffect } from 'react';
export default function Privacy1() {
  const scroll1 = useEffect(() => window.scrollTo(0, 0));
  return (
    <>
      <Navbar />
      <div className="p1">
        <div className="box-up">
          <Link to="/">
            <span className="	fas fa-chevron-left"></span>
          </Link>
          <span className="circle">
            <i className="fas fa-lock"></i>
          </span>

          <p className="title">سياسة الخصوصية وسرية المعلومات</p>
        </div>
        <span className="date">تاريخ السريان: [00/00/0000]</span>
        <p className="phar">
          نحن في <span className="name">Smart World</span> ملتزمون بحماية
          خصوصيتك. توضح سياسة الخصوصية هذه كيفية جمع واستخدام والكشف عن وحماية
          معلوماتك عند زيارتك لموقعنا الإلكتروني ، بما في ذلك أي وسائط أخرى أو
          قنوات إعلامية أو مواقع ويب للجوال أو تطبيقات جوال ذات صلة (يُشار إليها
          إجمالاً باسم "الموقع").
        </p>
        <ol>
          <div className="div_ol">
            <li className="title-ul">1 . المعلومات التي نجمعها:</li>
            <ul>
              قد نقوم بجمع الأنواع التالية من المعلومات:
              <li>
                المعلومات الشخصية: المعلومات التي تقدمها لنا طواعية، بما في ذلك،
                اسمك وعنوان بريدك الإلكتروني ورقم هاتفك وعنوانك البريدي ومعلومات
                الدفع.
              </li>
              <li>
                معلومات الحساب: التفاصيل التي تقدمها عند التسجيل للحصول على
                حساب، مثل المستخدم وكلمة المرور.
              </li>
              <li>
                بيانات المعاملات: معلومات تتعلق بالعطاءات والمناقصات والمدفوعات
                والمشاركة في المزادات.
              </li>
              <li>
                بيانات الاستخدام: المعلومات التي يتم جمعها تلقائيًا عند استخدامك
                للموقع، بما في ذلك عنوان IP ونوع المتصفح ونظام التشغيل وأوقات
                الوصول والصفحات التي تم عرضها.
              </li>
              <li>
                ملفات تعريف الارتباط والتقنيات المماثلة: البيانات التي يتم جمعها
                من خلال ملفات تعريف الارتباط والعلامات المشابهة.
              </li>
            </ul>
          </div>
          <div className="div_ol">
            <li className="title-ul">2 . كيفية استخدام معلوماتك:</li>
            <ul>
              نستخدم المعلومات التي نجمعها للأغراض التالية:
              <li>
                تسهيل إجراء المزادات والمناقصات والمعاملات الأخرى على الموقع.
              </li>
              <li>التحقق من هويتك والحفاظ على أمان الموقع.</li>
              <li>التواصل معك بخصوص حسابك ومعاملاتك وتحديثات الموقع.</li>
              <li>تحسين خدماتنا وتخصيص تجارب المستخدمين وتحليل أداء الموقع.</li>
              <li>
                الامتثال للالتزامات القانونية وإنفاذ شروط الخدمة الخاصة بنا.
              </li>
            </ul>
          </div>
          <div className="div_ol">
            <li className="title-ul">3 . الإفصاح عن معلوماتك:</li>
            <ul>
              قد نشارك معلوماتك مع:
              <li>
                مزودي الخدمات: جهات خارجية تقدم خدمات نيابة عنا، مثل معالجي
                الدفع ومقدمي خدمات تكنولوجيا المعلومات ودعم العملاء.
              </li>
              <li>
                المستخدمين الآخرين: في سياق المزادات أو المناقصات، قد يتم مشاركة
                التفاصيل الضرورية مع مقدمي العطاءات أو المنظمين.
              </li>
              <li>
                الالتزامات القانونية: السلطات أو الكيانات إذا كان ذلك مطلوبًا
                بموجب القانون أو لحماية حقوقنا.
              </li>
              <li>
                نقل الأعمال: في حالة الاندماج أو الاستحواذ أو بيع الأصول، قد يتم
                نقل معلوماتك إلى الجهة الخلف
              </li>
            </ul>
          </div>{' '}
          <div className="div_ol">
            <li className="title-ul">4 . الاحتفاظ بالبيانات:</li>
            <ul>
              نحتفظ بمعلوماتك طالما كان ذلك ضروريًا لتحقيق الأغراض الموضحة في
              سياسة الخصوصية هذه ما لم يكن مطلوبًا أو مسموحًا بفترة احتفاظ أطول
              بموجب القانون.
            </ul>
          </div>{' '}
          <div className="div_ol">
            <li className="title-ul">5 . أمان معلوماتك:</li>
            <ul>
              نطبق تدابير إدارية وتقنية ومادية معقولة لحماية معلوماتك. ومع ذلك،
              لا توجد طريقة نقل أو تخزين آمنة تمامًا، ولا يمكننا ضمان الأمان
              المطلق.
            </ul>
          </div>{' '}
          <div className="div_ol">
            <li className="title-ul">6 . حقوقك واختياراتك:</li>
            <ul>
              حسب موقعك، قد تكون لديك الحقوق التالية:
              <li>الوصول إلى المعلومات الشخصية التي نحتفظ بها عنك.</li>
              <li>طلب تصحيح أو حذف معلوماتك.</li>
              <li>الانسحاب من تلقي الاتصالات التسويقية.</li>
              <li>تقييد أو الاعتراض على معالجة بياناتك.</li>
            </ul>
          </div>{' '}
          لممارسة هذه الحقوق، يرجى التواصل معنا عبر البريد الإلكتروني [البريد
          الإلكتروني للتواصل].
          <div className="div_ol">
            <li className="title-ul">
              {' '}
              7 . ملفات تعريف الارتباط والتقنيات المماثلة:
            </li>
            <ul>
              نستخدم ملفات تعريف الارتباط لتحسين تجربتك على الموقع. يمكنك إدارة
              تفضيلات ملفات تعريف الارتباط من خلال إعدادات المتصفح الخاص بك.
              لمزيد من التفاصيل، يرجى مراجعة [سياسة ملفات تعريف الارتباط].
            </ul>
          </div>{' '}
          <div className="div_ol">
            <li className="title-ul">8 . الروابط الخارجية:</li>
            <ul>
              قد يحتوي الموقع على روابط لمواقع ويب تابعة لأطراف ثالثة. نحن لسنا
              مسؤولين عن ممارسات الخصوصية لهذه المواقع. يرجى مراجعة سياسات
              الخصوصية الخاصة بهم قبل تقديم أي معلومات. ملاحظة: هذا البند ليس
              ضرورياَ
            </ul>
          </div>
          <div className="div_ol">
            <li className="title-ul">9 . تغييرات على سياسة الخصوصية هذه:</li>
            <ul>
              قد نقوم بتحديث سياسة الخصوصية هذه من وقت لآخر. ستكون أي تغييرات
              سارية المفعول فور نشر السياسة المعدلة. نشجعك على مراجعة سياسة
              الخصوصية هذه بشكل دوري للبقاء على اطلاع.
            </ul>
          </div>
          <div className="div_ol">
            <li className="title-ul">10 .تواصل معنا:</li>
            <ul>
              إذا كانت لديك أي أسئلة أو مخاوف بشأن سياسة الخصوصية هذه، يرجى
              التواصل معنا عبر:
            </ul>
            <ul>
              smart_world@gmail.com
              <span className="dsa">
                <i className="fas fa-envelope-open"></i>
              </span>{' '}
            </ul>
            <ul>
              123-456-789
              <span className="dsa">
                <i className="fas fa-phone"></i>
              </span>
            </ul>
          </div>
          باستخدامك للموقع، فإنك توافق على شروط سياسة الخصوصية هذه.
        </ol>
      </div>
      <Footer black="privacy" />
    </>
  );
}
